src/main/resources/atscale-small/0036-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Session xmlns="urn:schemas-microsoft-com:xml-analysis" SessionId="2EF2676D-4D63-455D-A136-93C08062CB01"/>
  </soap:Header>
  <soap:Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>MDSCHEMA_MEASURES</RequestType>
      <Restrictions>
        <RestrictionList>
          <CUBE_NAME>AS Adventure Micro</CUBE_NAME>
          <MEASURE_VISIBILITY>3</MEASURE_VISIBILITY>
        </RestrictionList>
      </Restrictions>
      <Properties>
        <PropertyList>
          <Catalog>ASAdventureMicro</Catalog>
          <SafetyOptions>2</SafetyOptions>
          <MdxMissingMemberMode>Error</MdxMissingMemberMode>
          <DbpropMsmdOptimizeResponse>9</DbpropMsmdOptimizeResponse>
          <DbpropMsmdActivityID>BF00EFBA-6825-45D4-AD5D-F26EB2C668E6</DbpropMsmdActivityID>
          <DbpropMsmdRequestID>0652B815-E033-4BDE-88DC-72ACDC8A68FB</DbpropMsmdRequestID>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DbpropMsmdMDXCompatibility>1</DbpropMsmdMDXCompatibility>
        </PropertyList>
      </Properties>
    </Discover>
  </soap:Body>
</soap:Envelope>